Repository: DAGpro/validator
Catalog: docs/po/customizing-error-messages.md/*/customizing-error-messages.md.*.po
Languages: ru

source: Customizing error messages
ru: Настройка сообщений об ошибках

source: To use a non-default error message, pass a custom message/template when creating a validation rule. Generally the `message` option is responsible for storing error message:
ru: Чтобы использовать сообщение об ошибке, отличное от стандартного, передайте собственное сообщение/шаблон при создании правила валидации:

source: Some rules have multiple error messages and are overridden via different corresponding options. It is easy to differentiate them from the rest of the parameters by `Message` suffix:
ru: Некоторые правила имеют несколько сообщений об ошибках и переопределяются с помощью различных соответствующих параметров. Их легко отличить от остальных параметров по суффиксу `Message`:

source: A full list of supported placeholders with descriptions is available in PHPDoc for each message.
ru: Полный список поддерживаемых плейсхолдеров с описаниями доступен в PHPDoc для каждого сообщения.

source: Translating error messages
ru: Перевод сообщений об ошибках

source: The translation of error messages is implemented with the help of [Yii Translator] package, using messages in English language as a source. The translations are stored in a regular PHP file in associative array form, where keys are original messages and values are translations.
ru: Перевод сообщений об ошибках реализован с помощью пакета [Yii Translator], используя в качестве источника сообщения на английском языке. Переводы хранятся в обычном PHP-файле в виде ассоциативного массива, где ключи - это исходные сообщения, а значения - переведенные сообщения.

source: To use the translations, it's required to install an additional package for support of reading them from PHP files:
ru: Для использования переводов необходимо установить дополнительный пакет для поддержки их чтения из PHP-файлов:

source: When using a validator within the Yii ecosystem (an application uses [Yii Config] and the validator is obtained as a dependency via [Yii DI] container), the translations are plugged in automatically. Otherwise, a translator object must be created and configured manually. For example, like this:
ru: При использовании валидатора в экосистеме Yii (приложение использует [Yii Config], а валидатор получается как зависимость через [Yii DI] контейнер) переводы подключаются автоматически. В противном случае объект переводчика необходимо создать и настроить вручную. Например так:

source: You can check the available translations by viewing subfolders of the `messages` folder. If a required language is missing, feel free to submit a [PR].
ru: Вы можете проверить доступные переводы, посмотрев подпапки папки `messages`. Если необходимый язык отсутствует, не стесняйтесь отправить [PR].

source: Translating property names
ru: Перевод имен свойств

source: Almost all error templates have support for a `{property}` placeholder which is substituted with an actual property name that was set during rules configuration. By default, a property name is formatted as is. It can be acceptable for English language (for example, `currentPassword is required.`), but when using translations for error messages, it's better to provide an additional property translation.
ru: Почти все шаблоны ошибок поддерживают плейсхолдер `{property}`, который заменяется фактическим именем свойства, заданным во время настройки правил. По умолчанию имя свойства форматируется без изменений. Это может быть приемлемо для английского языка (например, `currentPassword is required.`), но при использовании перевода сообщений об ошибках, лучше предоставить дополнительный перевод свойства.

source: There is a separate interface called `PropertyTranslatorInterface` to solve exactly this task. It ships with 3 implementations out of the box:
ru: Для решения именно этой задачи существует отдельный интерфейс `PropertyTranslatorInterface`. Он поставляется с тремя реализациями из коробки:

source: - `ArrayPropertyTranslator` - uses an associative array, where keys are initial property names and values are their corresponding translated versions. - `TranslatorPropertyTranslator` - uses [Yii Translator]. - `NullPropertyTranslator` - dummy translator, returns property name as is without translation.
ru: - `ArrayPropertyTranslator` - использует ассоциативный массив, где ключи - это имена исходных свойств, а значения - их соответствующие переведенные версии. - `TranslatorPropertyTranslator` - использует [Yii Translator]. - `NullPropertyTranslator` - фиктивный переводчик, возвращает имя свойства как есть, без перевода.

source: There are several ways to use property translator.
ru: Существует несколько способов использования переводчика свойств.

source: Passing translator to validator instance
ru: Передача переводчика в экземпляр валидатора

source: It's quite self-explanatory, just create a property translator, define all translations, and pass it to the newly created validator instance. An example for Russian language:
ru: Это вполне очевидно: просто создайте переводчик свойств, определите все переводы и передайте их вновь созданному экземпляру валидатора. Пример для русского языка:

source: Passing within a data object for validation
ru: Передача внутри объекта данных для проверки

source: Another option is providing translations in the validated data object itself. This approach can be used to create a form classes for example.
ru: Другой вариант - предоставление переводов в самом валидируемом объекте данных. Этот подход может быть использован, например, для создания классов форм.

source: There is another special interface called `PropertyTranslatorProviderInterface` for this case allowing the validator to extract translations from the objects implementing it. An example for Russian language:
ru: Для этого случая существует еще один специальный интерфейс под названием `PropertyTranslatorProviderInterface`, позволяющий валидатору извлекать переводы из реализующих его объектов. Пример для русского языка:
