Repository: DAGpro/validator
Catalog: docs/po/conditional-validation.md/*/conditional-validation.md.*.po
Languages: ru

source: Conditional validation
ru: Условия валидации

source: Rules contain several options for skipping themselves under certain conditions. Not every rule supports all of these options, but the vast majority do.
ru: В правилах есть несколько параметров, задавая которые можно пропускать эти правила при определенных условиях. В подавляющем большинстве правил, хотя и не во всех, поддерживаются все параметры.

source: `skipOnError` - skip a rule in the set if the previous one failed
ru: `skipOnError` - пропустить правило в наборе, если предыдущее не прошло проверку

source: By default, if an error occurs while validating a property, all further rules in the set are processed. To change this behavior, use `skipOnError: true` for rules that need to be skipped:
ru: По умолчанию, даже если при проверке свойства возникает ошибка, обрабатываются все последующие правила в наборе. Для изменения этого поведения используйте `skipOnError: true` для правил, которые необходимо пропустить:

source: In the following example, checking the length of a username is skipped if the username is not filled.
ru: В следующем примере проверка длины имени пропускается, если имя пользователя не заполнено.

source: use Yiisoft\Validator\Rule\Length; use Yiisoft\Validator\Rule\Number; use Yiisoft\Validator\Rule\Regex; use Yiisoft\Validator\Rule\Required; use Yiisoft\Validator\Validator; $data = []; $rules = [ 'name' => [ // Validated. new Required(), // Skipped because "name" is required but not filled. new Length(min: 4, max: 20, skipOnError: true), // Validated because "skipOnError" is "false" by default. Set to "true" to skip it as well. new Regex('^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d]{8,}$'), ], 'age' => [ // Validated because "age" is a different property with its own set of rules. new Required(), // Validated because "skipOnError" is "false" by default. Set to "true" to skip it as well. new Number(min: 21), ], ]; $result = (new Validator())->validate($data, $rules);
ru: use Yiisoft\Validator\Rule\Length; use Yiisoft\Validator\Rule\Number; use Yiisoft\Validator\Rule\Regex; use Yiisoft\Validator\Rule\Required; use Yiisoft\Validator\Validator; $data = []; $rules = [ 'name' => [ // Проверяется. new Required(), // Пропускается, поскольку "name" является обязательным, но не заполнено. new Length(min: 4, max: 20, skipOnError: true), // Проверяется, поскольку "skipOnError" по умолчанию "false". Установите значение "true", чтобы также пропустить его. new Regex('^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d]{8,}$'), ], 'age' => [ // Проверяется, так как "age" это другое свойство со своим собственным набором правил. new Required(), // Проверяется, поскольку "skipOnError" по умолчанию "false". Установите значение "true", чтобы также пропустить его. new Number(min: 21), ], ]; $result = (new Validator())->validate($data, $rules);

source: Note that this setting must be set for each rule that needs to be skipped on error.
ru: Обратите внимание, что этот параметр должен быть установлен для каждого правила, которое необходимо пропустить в случае ошибки.

source: The same effect can be achieved with `StopOnError` and `Composite` rules, which can be more convenient for a larger number of rules.
ru: Такого же эффекта можно добиться с помощью правил `StopOnError` и `Composite`, которые могут быть более удобны для большого количества правил.

source: Using `StopOnError`:
ru: Использование `StopOnError`:

source: Using `Composite`:
ru: Использование `Composite`:

source: `skipOnEmpty` - skipping a rule if the validated value is "empty"
ru: `skipOnEmpty` - пропуск правила, если проверяемое значение "пустое"

source: By default, missing/empty values of properties are validated. If the value is missing, it is assumed to be `null`. If you want the property to be optional, use `skipOnEmpty: true`.
ru: По умолчанию, отсутствующие/пустые значения свойств проверяются. Если значение отсутствует, предполагается, что оно равно `null`. Если вы хотите, чтобы свойство было необязательным, используйте `skipOnEmpty: true`.

source: An example with an optional language property:
ru: Пример с необязательным свойством "language":

source: If the property is required, it is more appropriate to use `skipOnError: true` along with the preceding `Required` rule instead of `skipOnEmpty: true`. This is because the detection of empty values within the `Required` rule and skipping in further rules can be set separately. This is described in more detail below, see [Configuring empty condition in other rules] section.
ru: Если свойство является обязательным, более уместно использовать `skipOnError: true` вместе с предшествующим правилом `Required`, вместо `skipOnEmpty: true`. Это связано с тем, что обнаружение пустых значений в правиле `Required` и пропуск дальнейших правил можно настроить отдельно. Более подробно об этом написано ниже, см. раздел [Настройка "пустого условия" в других правилах].

source: Empty condition basics
ru: Основные сведения о "пустом условии"

source: What is considered empty can vary depending on the scope of usage.
ru: Что считать пустым может варьироваться в зависимости от сферы использования.

source: The value passed to `skipOnEmpty` is called "empty condition". Due to normalization the following shortcut values are supported:
ru: Значение, передаваемое в `skipOnEmpty` называется "пустым условием". Благодаря нормализации поддерживаются следующие сочетания:

source: - When `false` or `null`, `Yiisoft\Validator\EmptyCondition\NeverEmpty` is used automatically as a callback - every value is considered non-empty and validated without skipping (default). - When `true`, `Yiisoft\Validator\EmptyCondition\WhenEmpty` is used automatically as a callback - only passed (corresponding property must be present) and non-empty values (not `null`, `[]`, or `''`) are validated. - If a custom callback is set, it is used to determine emptiness.
ru: - Когда `false` или `null`, `Yiisoft\Validator\EmptyCondition\NeverEmpty` автоматически используется в качестве обратного вызова - каждое значение считается непустым и проверяется без пропуска (по умолчанию) - Когда `true`, `Yiisoft\Validator\EmptyCondition\WhenEmpty` автоматически используется в качестве обратного вызова - только переданное (соответствующее свойство должно присутствовать) и непустое значение (не `null`, `[]`, или `''`) проверяется. - Если установлен пользовательский обратный вызов, он используется для проверки на пустоту.

source: `false` is usually more suitable for HTML forms and `true` for APIs.
ru: `false` обычно больше подходит для HTML-форм, а `true` - для API.

source: There are some more conditions that have no shortcuts and need to be set explicitly because they are less used:
ru: Есть еще несколько условий, для которых нет сокращений и они должны быть заданы явно, поскольку используются реже:

source: `Yiisoft\Validator\EmptyCondition\WhenMissing` - a value is treated as empty only when it is missing (not passed at all).
ru: `Yiisoft\Validator\EmptyCondition\WhenMissing` - значение считается пустым только в том случае, если оно отсутствует (не передается вообще).

source: `Yiisoft\Validator\EmptyCondition\WhenNull` - limits empty values to `null` only.
ru: `Yiisoft\Validator\EmptyCondition\WhenNull` - ограничивает пустые значения только значением `null`.

source: An example with using `WhenNull` as parameter (note that an instance is passed, not a class name):
ru: Пример использования `WhenNull` в качестве параметра (обратите внимание, что передается экземпляр, а не имя класса):

source: Custom empty condition
ru: Пользовательское "пустое условие"

source: For even more customization you can use your own class that implements the `__invoke()` magic method. Here is an example where a value is empty only if it is missing (when using properties) or equals exactly to zero.
ru: Для еще большей настройки, вы можете использовать свой собственный класс, реализующий магический метод `__invoke()`. Вот пример, где значение пусто, только если оно отсутствует (при использовании свойств) или равно нулю.

source: or just a callable:
ru: или то же самое с помощью обратного вызова:

source: Using the class has the benefit of the code reusability.
ru: Преимущество использования класса заключается в возможности повторного использования кода.

source: Using the same non-default empty condition for all the rules
ru: Использование одного и того же пользовательского "пустого условия" для всех правил

source: For multiple rules, this can also be more conveniently set at the validator level:
ru: Для нескольких правил это может быть удобнее установить на уровне валидатора:

source: use Yiisoft\Validator\RuleHandlerResolver\SimpleRuleHandlerContainer; use Yiisoft\Validator\Validator; $validator = new Validator(skipOnEmpty: true); // Using the shortcut. $validator = new Validator( new SimpleRuleHandlerContainer(), // Using the custom callback. skipOnEmpty: static function (mixed $value, bool $isPropertyMissing): bool { return $value === 0; } );
ru: use Yiisoft\Validator\RuleHandlerResolver\SimpleRuleHandlerContainer; use Yiisoft\Validator\Validator; $validator = new Validator(skipOnEmpty: true); // Использование сокращения. $validator = new Validator( new SimpleRuleHandlerContainer(), // Использование пользовательского обратного вызова. skipOnEmpty: static function (mixed $value, bool $isPropertyMissing): bool { return $value === 0; } );

source: Configuring empty condition in other rules
ru: Настройка "пустого условия" в других правилах

source: Some rules, such as `Required` can't be skipped for empty values - that would defeat the purpose of the rule. However, empty condition can be configured here for detecting when a value is empty. Note - this does not skip the rule. It only determines what the empty condition is:
ru: Некоторые правила, такие как `Required` нельзя пропустить для пустых значений - это противоречит цели правила. Однако здесь можно настроить пустое условие для определения того, когда значение пусто. Обратите внимание - это не приводит к пропуску правила. Это только определяет что является "пустым условием":

source: It is also possible to set it globally for all rules of this type at the handler level via `RequiredHandler::$defaultEmptyCondition`.
ru: Также возможно установить его глобально для всех правил этого типа на уровне обработчика через `RequiredHandler::$defaultEmptyCondition`.

source: `when` provides the option to apply the rule depending on a condition of the provided callable. A callable's result determines if the rule will be skipped. The signature of the function is the following:
ru: `when` предоставляет возможность применить правило в зависимости от состояния обратного вызова. Результат обратного вызова определяет, будет ли правило пропущено. Сигнатура функции следующая:

source: where:
ru: где:

source: `$value` is a validated value;
ru: `$value` проверяемое значение;

source: `$context` is a validation context;
ru: `$context` контекст валидации;

source: `true` as a returned value means that the rule must be applied and a `false` means it must be skipped.
ru: возвращаемое значение: `true` означает, что правило должно быть применено, а `false`, что его необходимо пропустить.

source: In this example the state is only required when the country is `Brazil`. `$context->getDataSet()->getPropertyValue()` method allows you to get any other property's value within the `ValidationContext`.
ru: В этом примере штат требуется только в том случае, если страна - `Brazil`. Метод `$context->getDataSet()->getPropertyValue()` позволяет вам получить значение любого другого свойства в рамках `ValidationContext`:

source: As an alternative to functions, callable classes can be used instead. This approach has the advantage of code reusability. See the [Skip on empty] section for an example.
ru: В качестве альтернативы функциям, можно использовать callable-классы. Преимущество этого подхода заключается в возможности повторного использования кода. Пример см. в разделе [Skip on empty]

source: [Configuring empty condition in other rules]: #configuring-empty-condition-in-other-rules
ru: [Настройка "пустого условия" в других правилах]: #настройка-пустого-условия-в-других-правилах

source: [Skip on empty]: #skiponempty---skipping-a-rule-if-the-validated-value-is-empty
ru: [Skip on empty]: #skiponempty---пропуск-правила-если-проверяемое-значение-пустое
